/* ----
 Errors
 ---- */


/* Midas Login Failure */
"midas.login.failure" = "Please try again";

/* Twitter error title */
"twitter.error.title" = "Twitter Error";


/* Controller Titles */

"midas.vip.title" = "vip lounge";
"midas.driver.title" = "follow driver";
"midas.social.title" = "social";
"midas.video.title" = "video";
"midas.cameras.title" = "cameras";
"midas.circuit.title" = "circuit views";
"midas.standings.title" = "standings";
"midas.incidents.title" = "incidents";
"midas.help.title" = "help";

"midas.start.logo.watch" = "watch";
"midas.start.logo.chat" = "chat";
"midas.start.logo.share" = "share";
"midas.start.logo.play" = "play";